Enums/упВидыТранспорта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>упВидыТранспорта</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Водный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Воздушный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЛегковойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГрузовойАвтомобиль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Спецтехника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Автобус</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Железнодорожный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контейнер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/упВидыТранспорта/Ext/ManagerModule.bsl
Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	// контейнеры создаются из отдельного списка
	ДанныеВыбора = Новый СписокЗначений;
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.ЛегковойАвтомобиль);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.ГрузовойАвтомобиль);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Водный);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Воздушный);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Железнодорожный);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Автобус);
	ДанныеВыбора.Добавить(Перечисления.упВидыТранспорта.Спецтехника);
	
КонецПроцедуры
